reech_alpha/app/controllers/users_controller.rb

  def showconnections
    flash[:notice]
    @user = User.find_by_reecher_id(params[:reecher_id])

	 @all_connections=User.all
---
SELECT `users`.* FROM `users` WHERE `users`.`reecher_id` = 'Reecher-10590910786' LIMIT 1
SELECT `users`.* FROM `users`