reech_alpha/app/views/reech/home.html.erb

                        <h3 class="box-title">
                            <%= current_user.questions.size %>
---
SELECT COUNT(*) FROM `questions`
SELECT `questions`.* FROM `questions`