reech_alpha/app/controllers/api/v1/questions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`reecher_id` = 'Reecher-68580199019' LIMIT 1
SELECT `questions`.* FROM `questions` ORDER BY questions.created_at DESC
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
---
    def index
      @Questions = []
      questions_hash = []
      if params[:type] == "feed"
        @Questions = Question.filterforuser(params[:user_id])
      elsif params[:type] == "stared"
        #@Questions = Question.includes(:posted_solutions, :votings).order("created_at DESC").get_stared_questions(params[:user_id])
        #@Questions = Question.includes(:votings).order("created_at DESC").get_stared_questions(params[:user_id])
        user = User.find_by_reecher_id(params[:user_id])
        question_ids = Voting.select("question_id").where("user_id = ?", user.id) unless user.blank?
        #puts "question_ids==#{question_ids.inspect}"
        question_ids = question_ids.map{|q| q.question_id}
        @Questions = Question.where("id in (?)", question_ids).order("created_at DESC")  unless user.blank?

        elsif params[:type] == "self"
        user = User.find_by_reecher_id(params[:user_id])
        @Questions = user.questions.includes(:solutions, :votings).order("created_at DESC")
        # question which whose solution is purchased.
        my_purchases_solid = PurchasedSolution.select(:solution_id).where("user_id = ?", user.id)
        quest_hash =[]
        my_purchases_solid.each do |sid|
        qust_purc_sol=Question.joins(:solutions)
                   .select("questions.*,solutions.id as sol_id,solutions.question_id as sol_question_id")
                   .where("solutions.id = ?", sid.solution_id)
         quest_hash.push(qust_purc_sol[0][:id]) unless qust_purc_sol.blank?
        end
        my_quest= @Questions.map{|q| q.id}