reech_alpha/app/controllers/api/v1/user_sessions_controller.rb

			def create
				if params[:provider] == "standard"

				 # phone_number = filter_phone_number(params[:user_details][:phone_number])
				#	#@user_session = UserSession.new
				  #@user_session.phone_number = phone_number
				 # @user_session.password = params[:user_details][:password]
				 @user_session = UserSession.new(params[:user_details])
					puts "@user_session=#{@user_session.inspect}"
					if @user_session.save
						respond_to do |format|
							@user_id = User.find_by_email(@user_session.email).reecher_id
							@api_key = ApiKey.create(:user_id => @user_id.reecher_id).access_token
							#create a device token entry in device table for push notifications
							if !params[:device_token].blank? && !params[:platform].blank?
							  existing_device = Device.where(:device_token => params[:device_token], :platform => params[:platform], :reecher_id => @user_id.reecher_id)
							  if !existing_device.present?
							    device = Device.new()
							    device.device_token = params[:device_token]
							    device.platform = params[:platform]
							    device.reecher_id = @user_id.reecher_id
							    device.save
---
SELECT `users`.* FROM `users` WHERE (LOWER(`users`.email) = 'test@march6.date') LIMIT 1
UPDATE `users` SET `login_count` = 35, `failed_login_count` = 0, `last_login_at` = '2014-03-06 13:14:37', `current_login_at` = '2014-03-06 13:22:40', `last_request_at` = '2014-03-06 13:22:40', `updated_at` = '2014-03-06 13:22:40', `omniauth_data` = 'null' WHERE `users`.`id` = 1