reech_alpha/app/controllers/api/v1/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `encrypted_password`, `failed_login_count`, `first_name`, `last_login_at`, `last_login_ip`, `last_name`, `last_request_at`, `level`, `login_count`, `omniauth_data`, `password_salt`, `persistence_token`, `profile_id`, `profile_name`, `reecher_id`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sash_id`, `single_access_token`, `updated_at`) VALUES ('2014-03-06 08:51:30', '22e508f5752cba517400b6df6d945780060e4e807aefb4657a5fce7c8a4900b22846c954dc111d01688a18874aa6b1734952e076d17896923574438ff0f2e2e1', NULL, NULL, 'test@march6.date', '', 0, 'Test', NULL, NULL, 'March6', NULL, 0, 0, NULL, 'eLw6BEKc21Hm1tCFhHF', '98c2d1b59068bb3bb28b6526ded09977756bcc1e1feedf2de00a0a268523fbaa6fe289c505499eb76ac5ceed089021c56f87e00effaf60bf27dbba5813153619', '2G5gyZvh8tM=', 'reecher', 'Reecher-35787208339', NULL, NULL, NULL, NULL, 'mY6wJH8oF2b4NL7FHLPY', '2014-03-06 08:51:30')
INSERT INTO `user_profiles` (`bio`, `reecher_fav_books`, `reecher_fav_cuisines`, `reecher_fav_destinations`, `reecher_fav_movies`, `reecher_fav_music`, `reecher_fav_sports`, `reecher_hobbies`, `reecher_id`, `reecher_interests`, `snippet`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'Reecher-35787208339', NULL, NULL)
INSERT INTO `api_keys` (`access_token`, `created_at`, `updated_at`, `user_id`) VALUES ('4c5130ae1123721da93d14d9806ffe27', '2014-03-06 14:32:52', '2014-03-06 14:32:52', NULL)
---
			def create
				if !params.blank?
					if params[:provider] == "standard"
					  original_phone_number = params[:user_details][:phone_number]
					  phone_number = filter_phone_number(params[:user_details][:phone_number])
					  user = User.find_by_phone_number(phone_number)
						if user.nil?

								@user = User.new(params[:user_details])
								@user.original_phone_number = original_phone_number
								@user.phone_number = phone_number
								@user.password_confirmation = params[:user_details][:password]
											if @user.save
      									friend_con=make_auto_connection_with_referral_code @user.reecher_id, params[:referral_code]

      									 if friend_con
          									if !params[:profile_image].blank?
          										data = StringIO.new(Base64.decode64(params[:profile_image]))
          										@user.user_profile.picture = data
          										@user.user_profile.save
          									end
          	  							@user.add_points(500)
          	  							@api_key = ApiKey.create(:user_id => @user.reecher_id).access_token

UPDATE `users` SET `last_request_at` = '2014-03-06 08:51:30', `updated_at` = '2014-03-06 08:51:30', `omniauth_data` = 'null' WHERE `users`.`id` = 8
---
  							#@user.phone_number = @profile["phone"]
  							@user.fb_token = params[:user_details][:access_token]
  							@user.fb_uid = params[:user_details][:uid]
    							if @user.save(:validate => false)