reech_alpha/app/controllers/api/v1/user_profile_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`reecher_id` = 'Reecher-10590910786' LIMIT 1
UPDATE `users` SET `password_salt` = 'brXOLXgfY9wEjUu9gf8', `crypted_password` = '9f4ac8fdee615ea6fba8553aa268f9ccaec79abedd94004af311ed3294675146db0d5c4d1c1e367d31911cebbe48c48c7aed1d7aa7aa5970c528f6db4ba53526', `persistence_token` = '6f55a55648b8a8bea091637868b9d2322979a73d071faad82c8db854f3f1e4b63dadc55cac2a1373441ae685ab09715ba51f294447099dfe943560d689e91267', `login_count` = 34, `last_login_at` = '2014-03-06 11:25:11', `current_login_at` = '2014-03-06 13:14:37', `last_login_ip` = '192.168.1.64', `last_request_at` = '2014-03-06 13:14:37', `updated_at` = '2014-03-06 13:14:37', `omniauth_data` = 'null' WHERE `users`.`id` = 1
---
		  	def changepass
     		 @user = User.find_by_reecher_id(params[:user_id])
      	     @pass = params[:password]
      	     if !@user.nil?
      	     	if @pass.length < 8
      	     		msg = {:status => 400, :message => "password must be at least 8 characters"}
          			render :json => msg
      	     	else
					@user.password = @pass
	        		@user.password_confirmation = @pass
	        		@user.save!

SELECT `users`.* FROM `users` WHERE `users`.`reecher_id` = 'Reecher-10590910786' LIMIT 1
---
		  	def showconnections
        		@user=User.find_by_reecher_id(params[:user_id])